// Создать функцию multiply, которая будет принимать любое количество чисел и возвращать их произведение: multiplay(1,2,3) = 6. Если нет ни одного аргумента вернуть ноль.

const multiplay = (...numbers) => {
  let arr = numbers,
      result;
  // console.log(arr);
  if (arr.length == 0) {
    result = 0;
  } else {
    result = arr.reduce((sum, item) => sum * item);
    // console.log(result)
  }
  
  return result;
}

console.log(multiplay(1, 2, 3))


// С помощью рикурсе вычислить факториал числа 10.

const factorial = (num) => {
  return (num != 1) ? num * factorial(num - 1) : 1;
};
console.log(factorial(10))


// Создать функцию, которая принимает строку и возвращает перевернутую строку ('test') = 'tset'.

const strReverse = str => str.split('').reverse().join('');

console.log(strReverse('tests'));

// Написать функцию, которая проверяет является ли слово палиндромом

// Создать функцию, которая в качестве аргумента принимает строку из букв и возвращает строку, где каждый символ разделен пробелом и заменён на значение символа из юникода. ((hello) => "104 101 108 108 111")

// Написать функцию-рекурсию, которая выведет каждый символ строки в конcоль ('test') => 't' 'e' 's' 't'

// Создать две функции и дать им осмысленные названия:

// первая функция принимает массив и callback, возвращая строку из обработанного массива.
// вторая функция (callback) обрабатывает каждый элемент массива 